Tutorials-3.0.1/cdv/constant/polyMesh/blockMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 0 -0.5e-4)
    (-1 0.375 -0.5e-4)
    (-1 0.75 -0.5e-4)
    (0 0.25 -0.5e-4)
    (0 0.375 -0.5e-4)
    (0 0.5 -0.5e-4)
    (1 0 -0.5e-4)
    (1 0.375 -0.5e-4)  
    (1 0.75 -0.5e-4)
    (-1 0 0.5e-4)
    (-1 0.375 0.5e-4)
    (-1 0.75 0.5e-4)
    (0 0.25 0.5e-4)
    (0 0.375 0.5e-4)
    (0 0.5 0.5e-4)
    (1 0 0.5e-4)
    (1 0.375 0.5e-4)
    (1 0.75 0.5e-4)

);

blocks
(
    hex (0 1 4 7 6 3 9 10 13 16 15 12) (100 15 1) simpleGrading (1 1.5 1)
    hex (1 2 5 8 7 4 10 11 14 17 16 13) (100 15 1) simpleGrading (1 0.75 1)


);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 10 9)
            (1 2 11 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 7 16 15)
            (7 8 17 16)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (2 5 14 11)
            (5 8 17 14)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 12 9)
            (3 6 15 12)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (3 4 7 6)
            (1 2 5 4)
            (4 5 8 7)
            (9 10 13 12)
            (12 13 16 15)
            (10 11 14 13)
            (13 14 17 16)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
