Tutorials-3.0.1/cdv/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       49;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       50;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       51;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       101;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100;
        startFace       151;
    }
)

// ************************************************************************* //
