Tutorials-3.0.1/cdv/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }
    
    U
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }
    
    p
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }

    "(h|k|omega)"
    {
        $U;
    }
}

PIMPLE
{
    momentumPredictor	true;
    nNonOrthogonalCorrectors 1;
    nCorrectors		3;
    nonOrthogonalityThreshold	60.0;
    skewnessThreshold		1.0;
    updateEnergyInPISO true;
    
    kappaFunction
    {
        type        standardMachToAcCourantRatio;
        
        standardMachToAcCourantRatioCoeffs
        {
            writeMaxMin true;
        }

//        type        acceleratedSonicCourantInverse;
//        
//        acceleratedSonicCourantInverseCoeffs
//        {
//            power       4.0;
//            writeMaxMin false;
//            resetCoupledBoundaries false;
//            reinterpolateToFaces   false;
//        }
    }
}

// ************************************************************************* //
